RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_glb_misc.c
/**
  ******************************************************************************
  * @file    bl808_glb_misc.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808_clock.h"
#include "bl808_glb.h"
#include "bl808_aon.h"
#include "bl808_hbn.h"
#include "bl808_pds.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  GLB
 *  @{
 */

/** @defgroup  GLB_Private_Macros
 *  @{
 */



/*@} end of group GLB_Private_Macros */

/** @defgroup  GLB_Private_Types
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *glbBmxToIntCbfArra[BMX_TO_INT_ALL] = { NULL };
#endif

static BL_Err_Type GLB_Get_And_Clr_First_Set_From_U64(uint64_t *val, uint32_t *bit);

/*@} end of group GLB_Private_Types */

/** @defgroup  GLB_Private_Variables
 *  @{
 */

/*@} end of group GLB_Private_Variables */

/** @defgroup  GLB_Global_Variables
 *  @{
 */

/*@} end of group GLB_Global_Variables */

/** @defgroup  GLB_Private_Fun_Declaration
 *  @{
 */

/*@} end of group GLB_Private_Fun_Declaration */

/** @defgroup  GLB_Private_Functions
 *  @{
 */

/*@} end of group GLB_Private_Functions */

/** @defgroup  GLB_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  GLB set display clock
 *
 * @param  enable: ENABLE or DISABLE
 * @param  srcClk: source clock type
 * @param  evenDiv: divider in even number
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_Display_CLK(uint8_t enable, GLB_DISP_CLK_Type srcClk, uint8_t evenDiv)
{
    uint32_t tmpVal = 0;
    uint32_t evenNum = 0;

    CHECK_PARAM(IS_GLB_DISP_CLK_TYPE(srcClk));
    CHECK_PARAM((evenDiv <= 0x7F));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_MIPI_PLL_CFG1);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_MIPIPLL_EVEN_DIV_EN);
    BL_WR_REG(GLB_BASE, GLB_MIPI_PLL_CFG1, tmpVal);

    if ((evenDiv >= 8) && (evenDiv <= 126)) {
        evenNum = evenDiv & ~(1 << 0);
    } else {
        evenNum = evenDiv;
    }

    tmpVal = BL_RD_REG(GLB_BASE, GLB_MIPI_PLL_CFG1);
    if(enable){
        tmpVal = BL_SET_REG_BIT(tmpVal, GLB_MIPIPLL_EVEN_DIV_EN);
    }else{
        tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_MIPIPLL_EVEN_DIV_EN);
    }
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_MIPIPLL_EVEN_DIV_RATIO, evenNum);
    BL_WR_REG(GLB_BASE, GLB_MIPI_PLL_CFG1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  GLB enable or disable ethernet clock
 *
 * @param  enable: ENABLE or DISABLE
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_Ethernet_CLK_From_UHSPLL(uint8_t enable)

{
    uint32_t tmpVal = 0;

    /* uhspll_even_div_en */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_UHS_PLL_CFG1);
    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, GLB_UHSPLL_EVEN_DIV_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_UHSPLL_EVEN_DIV_EN);
    }
    BL_WR_REG(GLB_BASE, GLB_UHS_PLL_CFG1, tmpVal);

    return SUCCESS;
}



/****************************************************************************/ /**
 * @brief  DSP get MCU interrupt status
 *
 * @param  intType: MCU interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type GLB_DSP_Get_MCU_IntStatus(GLB_MCU_ALL_INT_Type intType)
{
    CHECK_PARAM(IS_GLB_MCU_ALL_INT_TYPE(intType));

    if (intType < 32) {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG16) & (1 << intType)) ? SET : RESET;
    } else {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG17) & (1 << (intType - 32))) ? SET : RESET;
    }
}

/****************************************************************************/ /**
 * @brief  DSP set MCU interrupt mask
 *
 * @param  intType: MCU interrupt type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_DSP_Set_MCU_IntMask(GLB_MCU_ALL_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_MCU_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG18);
        if (UNMASK != intMask) {
            tmpVal |= (1 << intType);
        } else {
            tmpVal &= ~(1 << intType);
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG18, tmpVal);
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG19);
        if (UNMASK != intMask) {
            tmpVal |= (1 << (intType - 32));
        } else {
            tmpVal &= ~(1 << (intType - 32));
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG19, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP clear MCU interrupt status
 *
 * @param  intType: MCU interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_DSP_Clr_MCU_IntStatus(GLB_MCU_ALL_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_MCU_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG20);
        tmpVal |= (1 << intType);
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG20, tmpVal);
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG21);
        tmpVal |= (1 << (intType - 32));
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG21, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP set LP interrupt enable
 *
 * @param  enable: ENABLE or DISABLE
 * @param  intType: LP interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_DSP_Set_LP_IntEn(uint8_t enable, GLB_LP_ALL_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_LP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG22);
        if (enable) {
            tmpVal |= (1 << intType);
        } else {
            tmpVal &= ~(1 << intType);
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG22, tmpVal);
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG23);
        if (enable) {
            tmpVal |= (1 << (intType - 32));
        } else {
            tmpVal &= ~(1 << (intType - 32));
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG23, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP get LP interrupt status
 *
 * @param  intType: LP interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type GLB_DSP_Get_LP_IntStatus(GLB_LP_ALL_INT_Type intType)
{
    CHECK_PARAM(IS_GLB_LP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG24) & (1 << intType)) ? SET : RESET;
    } else {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG25) & (1 << (intType - 32))) ? SET : RESET;
    }
}

/****************************************************************************/ /**
 * @brief  MCU get DSP interrupt status
 *
 * @param  intType: DSP interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type GLB_MCU_Get_DSP_IntStatus(GLB_DSP_ALL_INT_Type intType)
{
    CHECK_PARAM(IS_GLB_DSP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        return (BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_STA0) & (1 << intType)) ? SET : RESET;
    } else {
        return (BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_STA1) & (1 << (intType - 32))) ? SET : RESET;
    }
}

/****************************************************************************/ /**
 * @brief  MCU set DSP interrupt mask
 *
 * @param  intType: DSP interrupt type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_MCU_Set_DSP_IntMask(GLB_DSP_ALL_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DSP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK0);
        if (UNMASK != intMask) {
            tmpVal |= (1 << intType);
        } else {
            tmpVal &= ~(1 << intType);
        }
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK0, tmpVal);
    } else {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK1);
        if (UNMASK != intMask) {
            tmpVal |= (1 << (intType - 32));
        } else {
            tmpVal &= ~(1 << (intType - 32));
        }
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK1, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  MCU clear DSP interrupt status
 *
 * @param  intType: DSP interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_MCU_Clr_DSP_IntStatus(GLB_DSP_ALL_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DSP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_0);
        tmpVal |= (1 << intType);
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_0, tmpVal);
    } else {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_1);
        tmpVal |= (1 << (intType - 32));
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_1, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set MTimer clock
 *
 * @param  enable: enable or disable MTimer clock
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_MCU_MTimer_CLK(uint8_t enable, uint16_t div, uint8_t rst)
{
    uint32_t tmpVal;

    CHECK_PARAM((div <= 0x3FF));

    /* disable MTimer clock first */
    tmpVal = BL_RD_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_EN);
    BL_WR_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC, tmpVal);

    tmpVal = BL_RD_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_RST);
    BL_WR_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC, tmpVal);
    tmpVal = BL_RD_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC);
    tmpVal = BL_SET_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_RST);
    BL_WR_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC, tmpVal);
    tmpVal = BL_RD_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_RST);
    BL_WR_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC, tmpVal);

    tmpVal = BL_RD_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MCU_MISC_REG_MCU_RTC_DIV, div);
    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_EN);
    }
    BL_WR_REG(MCU_MISC_BASE, MCU_MISC_MCU_E907_RTC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set MTimer clock
 *
 * @param  enable: enable or disable MTimer clock
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_DSP_MTimer_CLK(uint8_t enable, uint16_t div, uint8_t rst)
{
    uint32_t tmpVal;

    CHECK_PARAM((div <= 0x3FF));

    /* disable MTimer clock first */
    tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_CPU_RTC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MM_MISC_C906_RTC_EN);
    BL_WR_REG(MM_MISC_BASE, MM_MISC_CPU_RTC, tmpVal);

    tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_CPU_RTC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MM_MISC_C906_RTC_RST);
    BL_WR_REG(MM_MISC_BASE, MM_MISC_CPU_RTC, tmpVal);
    tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_CPU_RTC);
    tmpVal = BL_SET_REG_BIT(tmpVal, MM_MISC_C906_RTC_RST);
    BL_WR_REG(MM_MISC_BASE, MM_MISC_CPU_RTC, tmpVal);
    tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_CPU_RTC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MM_MISC_C906_RTC_RST);
    BL_WR_REG(MM_MISC_BASE, MM_MISC_CPU_RTC, tmpVal);

    tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_CPU_RTC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_MISC_C906_RTC_DIV, div);
    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, MM_MISC_C906_RTC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, MM_MISC_C906_RTC_EN);
    }
    BL_WR_REG(MM_MISC_BASE, MM_MISC_CPU_RTC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set ADC clock
 *
 * @param  enable: enable frequency divider or not
 * @param  clkSel: ADC clock selection
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_ADC_CLK(uint8_t enable, GLB_ADC_CLK_Type clkSel, uint8_t div)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_GLB_ADC_CLK_TYPE(clkSel));
    CHECK_PARAM((div <= 0x3F));

